# HostId Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricationHostedInfo..::..HostId Property
FabricationHostedInfo Class See Also
---
Returns the Id of the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId HostId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostId {
	ElementId^ get ();
}
```

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace